## Plan output for hosting config

```
Acquiring state lock. This may take a few moments...

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.aws_db_instance.this[0] has changed
  ~ resource "aws_db_instance" "this" {
        id                                    = "db-AQO5FR4MFE4QXEK44UMOZ5DUYE"
        tags                                  = {
            "application"    = "sebt-portal-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
            "environment"    = "development"
            "program"        = "safety-net"
            "project"        = "sebt-portal"
        }
      + upgrade_rollout_order                 = "second"
        # (61 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)
-/+ destroy and then create replacement
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.app["dc-sebt-portal"].module.service["web"].aws_cloudwatch_log_group.this["performance"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + kms_key_id                  = "arn:aws:kms:us-east-1:816069131564:key/57071cd6-e68a-41e9-8b61-3e51e36d2131"
      + log_group_class             = (known after apply)
      + name                        = "/aws/ecs/containerinsights/sebt-portal-development-web/performance"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "application"    = "sebt-portal-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
          + "environment"    = "development"
          + "program"        = "safety-net"
          + "project"        = "sebt-portal"
        }
      + tags_all                    = {
          + "application"    = "sebt-portal-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
          + "environment"    = "development"
          + "program"        = "safety-net"
          + "project"        = "sebt-portal"
        }
    }

  # module.app["dc-sebt-portal"].module.service["web"].aws_cloudwatch_log_group.service has moved to module.app["dc-sebt-portal"].module.service["web"].aws_cloudwatch_log_group.this["service"]
    resource "aws_cloudwatch_log_group" "this" {
        id                          = "/aws/ecs/sebt-portal/development/web"
        name                        = "/aws/ecs/sebt-portal/development/web"
        tags                        = {
            "application"    = "sebt-portal-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
            "environment"    = "development"
            "program"        = "safety-net"
            "project"        = "sebt-portal"
        }
        # (8 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.endpoint_security_group.aws_security_group.this_name_prefix[0] must be replaced
+/- resource "aws_security_group" "this_name_prefix" {
      ~ arn                    = "arn:aws:ec2:us-east-1:816069131564:security-group/sg-0e6a26ddf95c7810e" -> (known after apply)
      ~ description            = "Security Group managed by Terraform" -> "Access for the sebt-portal load balancer." # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.1.0.0/16",
                ]
              - description      = "All protocols"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0e6a26ddf95c7810e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "sebt-portal-development-web-endpoint-20250612203302318000000003" -> (known after apply)
      ~ owner_id               = "816069131564" -> (known after apply)
        tags                   = {
            "Name"           = "sebt-portal-development-web-endpoint"
            "application"    = "sebt-portal-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
            "environment"    = "development"
            "program"        = "safety-net"
            "project"        = "sebt-portal"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.endpoint_security_group.aws_security_group_rule.egress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port                = 0 -> -1
      ~ id                       = "sgrule-2115756838" -> (known after apply)
      ~ security_group_id        = "sg-0e6a26ddf95c7810e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0bc2bc8c0fb639790" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 0 -> -1
        # (8 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.endpoint_security_group.aws_security_group_rule.ingress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "ingress_rules" {
      ~ id                       = "sgrule-1842025267" -> (known after apply)
      ~ security_group_id        = "sg-0e6a26ddf95c7810e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-080a2bfb5d109162f" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.endpoint_security_group.aws_security_group_rule.ingress_rules[1] must be replaced
-/+ resource "aws_security_group_rule" "ingress_rules" {
      ~ id                       = "sgrule-3606457303" -> (known after apply)
      ~ security_group_id        = "sg-0e6a26ddf95c7810e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0d76fdfd578887ebe" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0] must be replaced
-/+ resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-3881150374" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      ~ security_group_rule_id   = "sgr-0dba05fe47a10c6a1" -> (known after apply)
      ~ source_security_group_id = "sg-0e6a26ddf95c7810e" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
      ~ copy_tags_to_snapshot                 = false -> true
        id                                    = "db-AQO5FR4MFE4QXEK44UMOZ5DUYE"
      ~ password_wo                           = (write-only attribute)
        tags                                  = {
            "application"    = "sebt-portal-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
            "environment"    = "development"
            "program"        = "safety-net"
            "project"        = "sebt-portal"
        }
        # (60 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 6 to add, 1 to change, 5 to destroy.

Changes to Outputs:
  ~ app = {
      ~ dc-sebt-portal = {
          ~ services   = {
              ~ web = {
                  ~ endpoint_security_group_id = "sg-0e6a26ddf95c7810e" -> (known after apply)
                  + log_group_names            = [
                      + "/aws/ecs/containerinsights/sebt-portal-development-web/performance",
                      + "/aws/ecs/sebt-portal/development/web",
                    ]
                    # (8 unchanged attributes hidden)
                }
            }
            # (1 unchanged attribute hidden)
        }
    }

Warning: Deprecated attribute

  on .terraform/modules/app.doppler/main.tf line 82, in module "sync":
  82:   region           = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 12 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"

```